Script started on Monday 01 April 2019 10:49:24 AM IST
]0;s4d2@clab1-HP-Compaq-dc7900-Convertible-Minitower: ~[01;32ms4d2@clab1-HP-Compaq-dc7900-Convertible-Minitower[00m:[01;34m~[00m$ exitsudo nano /etc/resolv.confroute -n[K[Kifconfig enp0s25 down[2Pup[K[K enp0s25 192.168.0.2[Kgedit  hello.c[7P./a.outgedit hello.c[6P./a.out[1P/a.outgcc hello.c[4P./a.outcat abc.txtgedit  hello.c[3Pcat abc.txtls[Kgedit  hello.c[3Pcc[C[C[C[C[C[C[C[C[4P./a.outgedit  hello.c[7P./a.outgcc hello.c[3@edit [C[C[C[C[C[C[C[C[7P./a.outgcc hello.c[4P./a.outgedit  hello.c[3Pcc[C[C[C[C[C[C[C[C[4P./a.outgedit  hello.c[7P./a.outgcc hello.c[3@edit [C[C[C[C[C[C[C[Cls[Kcat abc.txtgedit  hello.c[3Pcat abc.txt[4P./a.outgcc hello.c[5P/a.out./a.outgedit hello.c[6P./a.outgedit  hello.c[6Pifconfig enp0s25 192.168.0.2[K enp0s25 updownroute[K -nsudo nano /etc/resolv.confexit[K[Kssh cs17d39@1920[K.168.0.30
.
              |
.  .    . .-. | .-..-. .--.--. .-.
 \  \  / (.-' |(  (   )|  |  |(.-'
  `' `'   `--'` `-'`-' '  '  ` `--'
cs17d39@192.168.0.30's password: 
Welcome to elementary OS 0.4.1 Loki (GNU/Linux 4.13.0-32-generic x86_64)

 * Website:  http://elementary.io/

278 packages can be updated.
0 updates are security updates.

Last login: Mon Apr  1 10:28:54 2019 from 192.168.0.140

$ ls
examples.desktop  new
$ cd new
$ mkdir newssh
$ nano file1
[?1049h[1;58r(B[m[4l[?7h[?1h=[?1h=[?1h=[39;49m[?25l[39;49m(B[m[H[2J[56;61H(B[0;7m[ New File ]
[3d(B[m[?12l[?25h[H[39;49m(B[0;7m  GNU nano 2.5.3                                 File: file1                                                                         [57;1H^G(B[m Get Help     (B[0;7m^O(B[m Write Out    (B[0;7m^W(B[m Where Is     (B[0;7m^K(B[m Cut Text     (B[0;7m^J(B[m Justify[81G(B[0;7m^C(B[m Cur Pos[97G(B[0;7m^Y(B[m Prev Page    (B[0;7mM-\(B[m First Line
[58d(B[0;7m^X(B[m Exit[58;17H(B[0;7m^R(B[m Read File    (B[0;7m^\(B[m Replace[49G(B[0;7m^U(B[m Uncut Text   (B[0;7m^T(B[m To Spell     (B[0;7m^_(B[m Go To Line   (B[0;7m^V(B[m Next Page    (B[0;7mM-/(B[m Last Line
[3d[1;124H(B[0;7mModified
[3d(B[msssh  h test 1
[4dsucccess   
[56d[K[4;6H  cess
[5d^X
[6dX[7d^x
[8dexit
[9d$ ^X
[10d[11dexit
[12d[56d(B[0;7mSave modified buffer (ANSWERING "No" WILL DESTROY CHANGES) ?                                                                         [57;1H Y(B[m Yes[K
[58d(B[0;7m N(B[m No  [58;18H(B[0;7mC(B[m Cancel[K[56;62H
(B[0;7mFile Name to Write: file1                                   
[57d^G(B[m Get Help[57;27H(B[0;7mM-D(B[m DOS Format[57;53H(B[0;7mM-A(B[m Append[57;79H(B[0;7mM-B(B[m Backup File
[58d(B[0;7m^C(B[m Cancel[17G          (B[0;7mM-M(B[m Mac Format[58;53H(B[0;7mM-P(B[m Prepend[58;79H(B[0;7m^T(B[m To Files[56;26H[?25l[56;57H[39;49m(B[m[1K (B[0;7m[ Wrote 10 lines ](B[m[K
[12d[56d[J[1;124H(B[0;7m        [58;133H(B[m[58;1H[?12l[?25h[?1049l
[?1l>$ nan   ^[[A^[[A^[[A            nano file1
[?1049h[1;58r(B[m[4l[?7h[?1h=[?1h=[?1h=[39;49m[?25l[39;49m(B[m[H[2J[56;59H(B[0;7m[ Reading File ]
[3d(B[m[56;65H(B[0;7m 10 lines ]
[13d(B[m[?12l[?25h[H[39;49m(B[0;7m  GNU nano 2.5.3                                 File: file1                                                                         [3;1H(B[mssh test 1
[4dsuccess
[5d^X
[6dX[7d^x
[8dexit
[9d$ ^X
[11dexit
[57d(B[0;7m^G(B[m Get Help     (B[0;7m^O(B[m Write Out    (B[0;7m^W(B[m Where Is     (B[0;7m^K(B[m Cut Text     (B[0;7m^J(B[m Justify[81G(B[0;7m^C(B[m Cur Pos[97G(B[0;7m^Y(B[m Prev Page    (B[0;7mM-\(B[m First Line
[58d(B[0;7m^X(B[m Exit[58;17H(B[0;7m^R(B[m Read File    (B[0;7m^\(B[m Replace[49G(B[0;7m^U(B[m Uncut Text   (B[0;7m^T(B[m To Spell     (B[0;7m^_(B[m Go To Line   (B[0;7m^V(B[m Next Page    (B[0;7mM-/(B[m Last Line
[3d[56d[J[58;133H[58;1H[?1049l
[?1l>$ mkdir newq
$ ls
file1  file.txt  newq  newssh
$ rm newq
rm: cannot remove 'newq': Is a directory
$ rm -r newq
$ ls
file1  file.txt  newssh
$ cd
$ ls
examples.desktop  new
$ cd new
$ ls
file1  file.txt  newssh
$ cd
$ ls
examples.desktop  new
$ exi   cd new
$ ls
file1  file.txt  newssh
$ cd ..
$ ls
examples.desktop  new
$ cd new
$ cd file1
-sh: 22: cd: can't cd to file1
$ cat   version
-sh: 23: version: not found
$ ^[[A^[[A^[[B            -sh   rm file1
$ ls
file.txt  newssh
$ nano file.txt
[?1049h[1;58r(B[m[4l[?7h[?1h=[?1h=[?1h=[39;49m[?25l[39;49m(B[m[H[2J[56;59H(B[0;7m[ Reading File ]
[3d(B[m[56;65H(B[0;7m 3 lines
[6d(B[m[?12l[?25h[H[39;49m(B[0;7m  GNU nano 2.5.3                                File: file.txt                                                                       [3;1H(B[munix or linux OS
[4dis UNIX good OS
[5dis Linux good OS
[57d(B[0;7m^G(B[m Get Help     (B[0;7m^O(B[m Write Out    (B[0;7m^W(B[m Where Is     (B[0;7m^K(B[m Cut Text     (B[0;7m^J(B[m Justify[81G(B[0;7m^C(B[m Cur Pos[97G(B[0;7m^Y(B[m Prev Page    (B[0;7mM-\(B[m First Line
[58d(B[0;7m^X(B[m Exit[58;17H(B[0;7m^R(B[m Read File    (B[0;7m^\(B[m Replace[49G(B[0;7m^U(B[m Uncut Text   (B[0;7m^T(B[m To Spell     (B[0;7m^_(B[m Go To Line   (B[0;7m^V(B[m Next Page    (B[0;7mM-/(B[m Last Line
[3d[56d[J[58;133H[58;1H[?1049l
[?1l>$ exit
Connection to 192.168.0.30 closed.

]0;s4d2@clab1-HP-Compaq-dc7900-Convertible-Minitower: ~[01;32ms4d2@clab1-HP-Compaq-dc7900-Convertible-Minitower[00m:[01;34m~[00m$ ssh cs17d39@192.168.0.30exit[Kssh cs17d39@192.168.0.30[C[C[C[1P cs17d39@192.168.0.30[1P cs17d39@192.168.0.30[1P cs17d39@192.168.0.30f cs17d39@192.168.0.30t cs17d39@192.168.0.30p cs17d39@192.168.0.30
ftp: cs17d39@192.168.0.30: Temporary failure in name resolution
ftp> exit
]0;s4d2@clab1-HP-Compaq-dc7900-Convertible-Minitower: ~[01;32ms4d2@clab1-HP-Compaq-dc7900-Convertible-Minitower[00m:[01;34m~[00m$ sftp
usage: sftp [-1246aCfpqrv] [-B buffer_size] [-b batchfile] [-c cipher]
          [-D sftp_server_path] [-F ssh_config] [-i identity_file] [-l limit]
          [-o ssh_option] [-P port] [-R num_requests] [-S program]
          [-s subsystem | sftp_server] host
       sftp [user@]host[:file ...]
       sftp [user@]host[:dir[/]]
       sftp -b batchfile [user@]host
]0;s4d2@clab1-HP-Compaq-dc7900-Convertible-Minitower: ~[01;32ms4d2@clab1-HP-Compaq-dc7900-Convertible-Minitower[00m:[01;34m~[00m$ sftpftp cs17d39@192.168.0.30[1@s
.
              |
.  .    . .-. | .-..-. .--.--. .-.
 \  \  / (.-' |(  (   )|  |  |(.-'
  `' `'   `--'` `-'`-' '  '  ` `--'
cs17d39@192.168.0.30's password: 
Connected to 192.168.0.30.
sftp> ls
examples.desktop   new                
sftp> lls
abc.txt  Desktop    examples.desktop  file.txt	linux1.txt  networking	 Pictures  ssh	      Videos
adialu	 Documents  file2.txt	      grep.txt	linux.txt   output1.txt  Public    Templates
a.out	 Downloads  file3.txt	      hello.c	Music	    output2.txt  sort.txt  vapu
sftp> ls
examples.desktop   new                
sftp> cd nw[Kew
sftp> touch s[K sftp.txt
Invalid command.

sftp> cat sftp.txt
Invalid command.

sftp> mk[K[Kopen sftp.xt
Invalid command.

sftp> exit
]0;s4d2@clab1-HP-Compaq-dc7900-Convertible-Minitower: ~[01;32ms4d2@clab1-HP-Compaq-dc7900-Convertible-Minitower[00m:[01;34m~[00m$ sftp cs17d39@192.168.0.30[1P cs17d39@192.168.0.30[1P cs17d39@192.168.0.30[1P cs17d39@192.168.0.30s cs17d39@192.168.0.30h cs17d39@192.168.0.30
.
              |
.  .    . .-. | .-..-. .--.--. .-.
 \  \  / (.-' |(  (   )|  |  |(.-'
  `' `'   `--'` `-'`-' '  '  ` `--'
cs17d39@192.168.0.30's password: 
Permission denied, please try again.

cs17d39@192.168.0.30's password: 
Connection to 192.168.0.30 closed by remote host.

Connection to 192.168.0.30 closed.

]0;s4d2@clab1-HP-Compaq-dc7900-Convertible-Minitower: ~[01;32ms4d2@clab1-HP-Compaq-dc7900-Convertible-Minitower[00m:[01;34m~[00m$ ssh cs17d39@192.168.0.30[1@ftp[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C
.
              |
.  .    . .-. | .-..-. .--.--. .-.
 \  \  / (.-' |(  (   )|  |  |(.-'
  `' `'   `--'` `-'`-' '  '  ` `--'
cs17d39@192.168.0.30's password: 
Connected to 192.168.0.30.
sftp> ls
examples.desktop   new                
sftp> ls new
new/file.txt  new/newssh    
sftp> cd [K[Kmdir [K[K[K[Kmkdir sftp
sftp> pwd
Remote working directory: /home/cs17d39
sftp> ls
examples.desktop   new                sftp               
sftp> cd new
sftp> mkdir sftp
sftp> ls
file.txt  newssh    sftp      
sftp> cd sftp
sftp> lls
abc.txt  Desktop    examples.desktop  file.txt	linux1.txt  networking	 Pictures  ssh	      Videos
adialu	 Documents  file2.txt	      grep.txt	linux.txt   output1.txt  Public    Templates
a.out	 Downloads  file3.txt	      hello.c	Music	    output2.txt  sort.txt  vapu
sftp> get file.txt
File "/home/cs17d39/new/sftp/file.txt" not found.

sftp> put file,[K.txt
Uploading file.txt to /home/cs17d39/new/sftp/file.txt

file.txt                                                                                             0%    0     0.0KB/s   --:-- ETA
file.txt                                                                                           100%   50     0.1KB/s   00:00    
sftp> ls
file.txt  
sftp> rm file.txt
Removing /home/cs17d39/new/sftp/file.txt
sftp> touch f.txt
Invalid command.

sftp> lls
abc.txt  Desktop    examples.desktop  file.txt	linux1.txt  networking	 Pictures  ssh	      Videos
adialu	 Documents  file2.txt	      grep.txt	linux.txt   output1.txt  Public    Templates
a.out	 Downloads  file3.txt	      hello.c	Music	    output2.txt  sort.txt  vapu
sftp> cd Downloads
Couldn't stat remote file: No such file or directory

sftp> exit
]0;s4d2@clab1-HP-Compaq-dc7900-Convertible-Minitower: ~[01;32ms4d2@clab1-HP-Compaq-dc7900-Convertible-Minitower[00m:[01;34m~[00m$ sftp cs17d39@192.168.0.30
.
              |
.  .    . .-. | .-..-. .--.--. .-.
 \  \  / (.-' |(  (   )|  |  |(.-'
  `' `'   `--'` `-'`-' '  '  ` `--'
cs17d39@192.168.0.30's password: 
Connected to 192.168.0.30.
sftp> ls
examples.desktop   new                sftp               
sftp> exit
]0;s4d2@clab1-HP-Compaq-dc7900-Convertible-Minitower: ~[01;32ms4d2@clab1-HP-Compaq-dc7900-Convertible-Minitower[00m:[01;34m~[00m$ exit
exit

Script done on Monday 01 April 2019 11:43:04 AM IST
